Revit 2027 API
IPerformanceAdviserRule.FinalizeCheck Method
 Invoked by performance advisor once in the end of the check.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void FinalizeCheck(
	Document document
)
Sub FinalizeCheck (
	document As Document
)
void FinalizeCheck(
	Document^ document
)
abstract FinalizeCheck :
        document : Document -> unit
Parameters
document Document
 Document for which performance problems are being checked.
See Also
Reference
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace